/**
 * Created by W.Hao on 2014/4/14.
 */

define(function (require, exports, module) {

    var init = (function(){
    	var _isInit = false;

        return function(){
        	if (_isInit)
                return;


//            $("#change-catalog a").click(function(){
//                var data = {"tableCaption":"单位名录库","isRegion":true,"groups":[[{"code":"140100000000","name":"太原市"},{"code":"140200000000","name":"大同市"},{"code":"140300000000","name":"阳泉市"},{"code":"140400000000","name":"长治市"},{"code":"140500000000","name":"晋城市"},{"code":"140600000000","name":"朔州市"},{"code":"140700000000","name":"晋中市"},{"code":"140800000000","name":"运城市"},{"code":"140900000000","name":"忻州市"},{"code":"141000000000","name":"临汾市"},{"code":"141100000000","name":"吕梁市"}]],"fieldCaption":["单位个数","年末从业人员数（具有研究生及以上学历人员）","年末从业人员数（具有大学本科学历人员）","年末从业人员数（具有大专学历人员）","年末从业人员数（具有高中学历人员）","年末从业人员数（具有初中及以下学历人员）","产业活动单位个数（总计）","产业活动单位个数（农林牧渔业）","产业活动单位个数（工业）","产业活动单位个数（建筑业）","产业活动单位个数（批发、零售业）","产业活动单位个数（住宿、餐饮业）","产业活动单位个数（房地产业）","产业活动单位个数（其他）","年末从业人员数（具有高级技术职称人员）","年末从业人员数（具有中级技术职称人员）","年末从业人员数（具有初级技术职称人员）","年末从业人员数（高级技师）","年末从业人员数（技师）","年末从业人员数（高级工）","年末从业人员数（中级工）","资产总计","企业全年营业收入","企业主营业务收入"],"fieldCode":["regioncode","regionname","count","A00048","A00048","A00048","A00048","A00048","A00048","A00048","A00048","A00048","A00048","A00048","A00048","A00048","A00048","A00048","A00048","A00048","A00048","A00048","A00048","A00048","A00048","A00048"],"fieldType":["2","2","2","2","2","2","2","2","2","2","2","2","2","2","2","2","2","2","2","2","2","2","2"],"unit":["个","人","人","人","人","人","个","个","个","个","个","个","个","个","人","人","人","人","人","人","人","千元","千元","千元"],"fieldValue":[["140100000000","太原市","2920","3531","24969","30818","46033","55885","3649","6","514","178","966","94","140","1751","5206","13160","13373","774","3975","7487","7489","113401502","58034127","57189513"],["140200000000","大同市","1417","335","7774","12598","21296","22245","1957","5","234","44","306","34","48","1286","1398","5659","7793","155","823","3331","3195","63863614","15508675","15023903"],["140300000000","阳泉市","692","65","1762","3777","5829","10171","927","1","138","19","206","21","21","521","277","1558","1947","95","138","317","1324","9381687","4730489","4570032"],["140400000000","长治市","1593","236","5022","10935","15311","24118","2540","3","332","42","362","33","43","1725","616","3567","5694","100","475","1156","1658","19900497","13671821","13571511"],["140500000000","晋城市","1146","103","3127","7300","14976","23012","1776","0","237","35","324","21","28","1131","315","2552","4330","247","372","781","1623","9596810","12739174","12631084"],["140600000000","朔州市","794","133","4195","6976","15787","13054","1028","0","109","17","181","10","17","694","832","3139","4162","66","752","1605","2162","42080642","33583118","33048453"],["140700000000","晋中市","1402","158","4035","7865","14937","26457","2029","12","427","35","236","29","23","1267","667","3004","4435","130","711","1346","2444","15548432","15837957","15758642"],["140800000000","运城市","1655","307","6452","14704","25010","29023","2491","28","425","45","387","25","28","1553","817","4498","6135","335","800","1881","4136","15561691","12696844","12512564"],["140900000000","忻州市","1462","490","5164","7471","11768","13001","1941","6","278","19","189","17","18","1414","974","4013","4419","188","528","1005","1855","5680504","4515979","4471972"],["141000000000","临汾市","1878","249","4866","12878","17489","16434","2767","17","398","50","413","40","34","1815","642","4451","5840","149","591","2098","2174","21899966","11764790","11705093"],["141100000000","吕梁市","1116","215","5339","9682","14166","15801","1783","4","269","20","150","7","18","1315","720","3760","5089","152","594","1496","2679","24953514","12733032","11837874"]]};
//                mapDataInit('山西', data);
//            });

            _isInit = true;
        }
    })();

    //Map 
    var Map = (function () {

        return {

        }
    })();	//Map end

    /**
     *
     * @param regionName 
     * @param fullData
     */
    var mapDataInit = function(regionName, fullData){
        var data = [];
        var fieldValue = fullData.fieldValue;
        if (fieldValue){
            var leng = fieldValue.length;
            for (var i = 0; i < leng; i++) {
                var record = fieldValue[i];
                data.push({
                    name : record[1],
                    value : record[2]
                })
            }
        }

        var option = {
            title : {
                text: '单位数量（个）',
                subtext: '快速汇总',
                x:'center'
            },
            tooltip : {
                trigger: 'item'
            },
            legend: {
                orient: 'vertical',
                x:'left',
                data:['单位数量（个）']
            },
            dataRange: {
                min: 0,
                max: 2500,
                text:['高','低'],           // 文本，默认为数值文本
                calculable : true
            },
            toolbox: {
                show : true,
                orient : 'vertical',
                x: 'right',
                y: 'center',
                feature : {
                    mark : {show: true},
                    dataView : {show: true, readOnly: false},
                    restore : {show: true},
                    saveAsImage : {show: true}
                }
            },
            series : [
                {
                    name: '单位数量（个）',
                    type: 'map',
                    mapType: regionName || 'china',
                    itemStyle:{
                        normal:{label:{show:true}},
                        emphasis:{label:{show:true}}
                    },
                    data:data
                }
            ]
        };

        var myChart = echarts.init(document.getElementById('chart-body'));
        myChart.setOption(option);
    };

    return {
        init : init,
        mapDataInit : mapDataInit
    }

});